RAKWireless/RAK-STM32-RUI/boards.txt
WisDuoRAK3272SiPBoard.build.flags.inc_path="-I{runtime.platform.path}/variants/{build.variant}" "-I{runtime.platform.path}/system/{build.variant}" "-I{runtime.platform.path}/cores/STM32WLE/app/RAK3272-SiP/src" "-I{runtime.platform.path}/cores/STM32WLE/component/inc" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/stm32wle5xx" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/stm32wle5xx/uhal" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/stm32wle5xx/uhal/serial" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/none/uhal" "-I{runtime.platform.path}/cores/STM32WLE/component/core/board/{build.series}" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/serial" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/timer" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/delay" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/spimst" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/powersave" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/gpio" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/rtc" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/twimst" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/dfu" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/pwm" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/adc" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/system" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/ble" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/flash" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/wdt" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/nfc" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/pdm" "-I{runtime.platform.path}/cores/STM32WLE/component/service/lora" "-I{runtime.platform.path}/cores/STM32WLE/component/service/lora/packages" "-I{runtime.platform.path}/cores/STM32WLE/component/service/nvm" "-I{runtime.platform.path}/cores/STM32WLE/component/service/battery" "-I{runtime.platform.path}/cores/STM32WLE/component/service/debug" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode/cli" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode/transparent" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode/protocol" "-I{runtime.platform.path}/cores/STM32WLE/component/rui_v3_api" "-I{runtime.platform.path}/cores/STM32WLE/component/rui_v3_api/avr" "-I{runtime.platform.path}/cores/STM32WLE/component/fund/event_queue" "-I{runtime.platform.path}/cores/STM32WLE/component/fund/circular_queue" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac/region" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/radio" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/system" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/peripherals" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/apps/LoRaMac/common/LmHandler" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/boards" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Drivers/CMSIS/Device/ST/STM32WLxx/Include" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Drivers/CMSIS/Include" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Drivers/STM32WLxx_HAL_Driver/Inc" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Middlewares/Third_Party/SubGHz_Phy/stm32_radio_driver" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Middlewares/Third_Party/SubGHz_Phy" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/timer" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/lpm/tiny_lpm" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/misc" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/sequencer" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/trace/adv_trace" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/boards" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac/region" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/radio" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/peripherals/" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Libraries/queue" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Libraries/include" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Libraries/scheduler" "-I{runtime.platform.path}/cores/STM32WLE/external/FatFs/source" "-I{runtime.platform.path}/cores/STM32WLE/external/spiffs/src"
WisDuoRAK3272SiPBoard.build.ldscript=flash_stm32wle5xx.ld
WisDuoRAK3272SiPBoard.build.vid=0x1A86
WisDuoRAK3272SiPBoard.build.pid=0x7523

# Debug Menu
WisDuoRAK3272SiPBoard.menu.debug.l0=Level 0 (Release)
WisDuoRAK3272SiPBoard.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
WisDuoRAK3272SiPBoard.menu.debug.l1=Level 1 (Error Message)
WisDuoRAK3272SiPBoard.debug.l1.build.debug_flags=-DCFG_DEBUG=1
WisDuoRAK3272SiPBoard.menu.debug.l2=Level 2 (Full Debug)
WisDuoRAK3272SiPBoard.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
WisDuoRAK3272SiPBoard.menu.debug.l3=Level 3 (Segger SystemView)
WisDuoRAK3272SiPBoard.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
WisDuoRAK3272SiPBoard.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

WisDuoRAK3272SiPBoard.menu.supportat.1=On
WisDuoRAK3272SiPBoard.menu.supportat.1.build.support_at_flag=-DSUPPORT_AT
WisDuoRAK3272SiPBoard.menu.supportat.2=Off
WisDuoRAK3272SiPBoard.menu.supportat.2.build.support_at_flag=-USUPPORT_AT


# ----------------------------------
# WisDuo RAK3272LP-SiP Board
# ----------------------------------
WisDuoRAK3272LPSiPBoard.name=WisDuo RAK3272LP-SiP Board
WisDuoRAK3272LPSiPBoard.bootloader.tool=bootburn
WisDuoRAK3272LPSiPBoard.build.variant_h=variant_{build.board}.h
WisDuoRAK3272LPSiPBoard.build.series=rak3172-sip

# Upload
WisDuoRAK3272LPSiPBoard.upload.tool=uploader_ymodem
WisDuoRAK3272LPSiPBoard.upload.protocol=uploader_ymodem
WisDuoRAK3272LPSiPBoard.upload.use_1200bps_touch=true
WisDuoRAK3272LPSiPBoard.upload.wait_for_upload_port=true
WisDuoRAK3272LPSiPBoard.upload.maximum_size=200704
WisDuoRAK3272LPSiPBoard.upload.maximum_data_size=48640

# Build
WisDuoRAK3272LPSiPBoard.build.mcu=cortex-m4
WisDuoRAK3272LPSiPBoard.build.f_cpu=64000000
WisDuoRAK3272LPSiPBoard.build.board=WisDuo_RAK3272-SiP_Board
WisDuoRAK3272LPSiPBoard.build.core=STM32WLE
WisDuoRAK3272LPSiPBoard.build.variant=WisDuo_RAK3272-SiP_Board
WisDuoRAK3272LPSiPBoard.build.usb_manufacturer="RAKwireless"
WisDuoRAK3272LPSiPBoard.build.usb_product="WisDuo RAK3272-SiP Board"
WisDuoRAK3272LPSiPBoard.build.extra_flags=-DSTM32WLE5xx -DRAK3272_SIP_VA -Drak3172_sip {build.flags.usb}
WisDuoRAK3272LPSiPBoard.build.ldscript=flash_stm32wle5xx.ld
WisDuoRAK3272LPSiPBoard.build.vid=0x1A86
WisDuoRAK3272LPSiPBoard.build.pid=0x7523

# Debug Menu
WisDuoRAK3272LPSiPBoard.menu.debug.l0=Level 0 (Release)
WisDuoRAK3272LPSiPBoard.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
WisDuoRAK3272LPSiPBoard.menu.debug.l1=Level 1 (Error Message)
WisDuoRAK3272LPSiPBoard.debug.l1.build.debug_flags=-DCFG_DEBUG=1
WisDuoRAK3272LPSiPBoard.menu.debug.l2=Level 2 (Full Debug)
WisDuoRAK3272LPSiPBoard.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
WisDuoRAK3272LPSiPBoard.menu.debug.l3=Level 3 (Segger SystemView)
WisDuoRAK3272LPSiPBoard.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
WisDuoRAK3272LPSiPBoard.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

WisDuoRAK3272LPSiPBoard.menu.supportat.1=On
WisDuoRAK3272LPSiPBoard.menu.supportat.1.build.support_at_flag=-DSUPPORT_AT
WisDuoRAK3272LPSiPBoard.menu.supportat.2=Off
WisDuoRAK3272LPSiPBoard.menu.supportat.2.build.support_at_flag=-USUPPORT_AT

